brew "asdf"
brew "fish"
brew "git"
brew "gpg"
brew "pinentry-mac"
brew "postgresql", restart_service: :changed, link: true
brew "redis", restart_service: :changed
brew "vim"
brew "yadm"
brew "zsh"

# Ruby dependencies
brew "autoconf"
brew "gmp"
brew "libyaml"
brew "openssl@3"
brew "readline"

brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
